GROUP_ID = 194634835
TOKEN = '93e01439e949317333e343425db0a3138dcd02b5f46bfcc45369df306892096b5e84a09ababb0bb49760b'

INTENTS = [
    {"name": "Помощь",
     "tokens": ("/help",),
     "scenario": None,
     "answer": "Это чат-бот предназначенный для заказа билета на самолет,"
               " чтобы заказать билет включите помощника командой - /ticket, чтобы в процессе заказа начать заново -"
               "наберите также - /ticket"
     },
]

SCENARIO = {
    "ticket": {
        "first_step": "step1",
        "steps": {
            "step1": {
                "text": "\nВы запустили помощника для заказа билета на самолет \nВведите Ваше имя: ",
                "failure_text": "Введите корректное имя ",
                "fail_action": None,
                "handler": "handle_name",
                "next_step": "step2"
            },

            "step2": {
                "text": "\nВведите Ваш e-mail, мы отправим на него все данные: ",
                "failure_text": "Введите корректный e-mail ",
                "fail_action": None,
                "handler": "handle_email",
                "next_step": "step3"
            },

            "step3": {
                "text": "\nВведите город отправения: ",
                "failure_text": "Выберите из списка доступных городов: ",
                "fail_action": 'fail_city_out_action',
                "handler": "handle_city_out",
                "next_step": "step4"
            },
            "step4": {
                "text": "Введите город назначения:",
                "failure_text": "Выберите из списка доступных городов: ",
                "fail_action": 'fail_city_in_action',
                "action": "check_flights_action",
                "handler": "handle_city_in",
                "next_step": "step5"
            },
            "step5": {
                "text": "Введите дату вылета в формате дд-мм-гггг: ",
                "failure_text": "Введена неверная дата",
                "handler": "handle_date",
                "next_step": "step6"
            },
            "step6": {
                "text": 'Из города {city_out} в город {city_in} есть рейсы:',
                "action": 'list_flights',
                "failure_text": "Такого рейса нет",
                "handler": "handle_flights",
                "next_step": "step7"
            },

            "step7": {
                "text": "Выберите количество мест от 1 до 5:  ",
                "failure_text": "Введено неверное количество мест",
                "handler": "handle_sits",
                "next_step": "step8"
            },

            "step8": {
                "text": "Введите комментарий для заказа: ",
                "failure_text": "Введен неверный город",
                "handler": "handle_comment",
                "next_step": "step9"
            },
            "step9": {
                "text": "Проверьте правильность введенных Вами данных (Если все верно напишите ДА, иначе НЕТ): ",
                "failure_text": "Введите ДА или НЕТ",
                "action": 'correct_check',
                "fail_action": "not_yes",
                "handler": "handle_correct_data",
                "next_step": "step10"
            },
            "step10": {
                "text": "Укажите свой номер телефона: ",
                "action": 'send_image',
                "failure_text": "Введен неверный номер телефона",
                "handler": "handle_phone_number",
                "next_step": "step11"
            },
            "step11": {
                "text": "Спасибо за заказ, мы отправим данные Вам на email: {email}.",
                "failure_text": None,
                "handler": None,
                "next_step": None
            }
        }
    }
}

DEFAULT_ANSWER = 'Наберите команду - /help для помощи'

FLIGHT_SCHEDULE = {
    'москва': {
        'санкт-петербург': [
            ['1', '10-05-2020', '14:00'], ['2', '11-05-2020', '14:00'], ['3', '12-05-2020', '14:00'],
            ['4', '13-05-2020', '14:00'], ['5', '14-05-2020', '14:00'], ['6', '15-05-2020', '14:00'],
            ['7', '16-05-2020', '14:00'], ['8', '17-05-2020', '14:00'], ['9', '18-05-2020', '14:00'],
            ['10', '19-05-2020', '14:00'], ['11', '20-05-2020', '14:00'], ['12', '21-05-2020', '14:00'],
            ['13', '22-05-2020', '14:00'], ['14', '23-05-2020', '14:00'], ['15', '24-05-2020', '14:00'],
        ],
        'нью-йорк': [
            ['31', '10-05-2020', '10:00'], ['32', '20-05-2020', '10:00'], ['33', '10-06-2020', '10:00'],
            ['34', '20-06-2020', '10:00'], ['35', '10-07-2020', '10:00'], ['36', '20-07-2020', '10:00'],
        ],

        'париж': [
            ['43', '12-05-2020', '18:00'], ['44', '14-05-2020', '18:00'], ['45', '19-05-2020', '18:00'],
            ['46', '21-05-2020', '18:00'], ['47', '26-05-2020', '18:00'], ['48', '28-05-2020', '18:00'],
            ['49', '02-06-2020', '18:00'], ['50', '04-06-2020', '18:00'], ['51', '09-06-2020', '18:00'],
            ['52', '11-06-2020', '18:00']

        ],

    },

    'санкт-петербург': {
        'москва': [
            ['16', '10-05-2020', '16:00'], ['17', '11-05-2020', '16:00'], ['18', '12-05-2020', '16:00'],
            ['19', '13-05-2020', '16:00'], ['20', '14-05-2020', '16:00'], ['21', '15-05-2020', '16:00'],
            ['22', '16-05-2020', '16:00'], ['23', '17-05-2020', '16:00'], ['24', '18-05-2020', '16:00'],
            ['25', '19-05-2020', '16:00'], ['26', '20-05-2020', '16:00'], ['27', '21-05-2020', '16:00'],
            ['28', '22-05-2020', '16:00'], ['29', '23-05-2020', '16:00'], ['30', '24-05-2020', '16:00'],

        ],
        'нью-йорк': [
            ['63', '15-05-2020', '7:00'], ['64', '25-05-2020', '7:00'], ['65', '15-06-2020', '7:00'],
            ['66', '25-06-2020', '7:00'], ['67', '15-07-2020', '7:00'], ['68', '25-07-2020', '7:00'],
        ],
        'париж': [
            ['75', '30-05-2020', '11:00'], ['76', '30-06-2020', '11:00'], ['77', '30-07-2020', '11:00'],
            ['78', '30-08-2020', '11:00'], ['79', '30-09-2020', '11:00'], ['80', '30-10-2020', '11:00'],
        ],
    },

    'нью-йорк': {
        'москва': [
            ['37', '10-05-2020', '23:00'], ['38', '20-05-2020', '23:00'], ['39', '10-06-2020', '23:00'],
            ['40', '20-06-2020', '23:00'], ['41', '10-07-2020', '23:00'], ['42', '20-07-2020', '23:00'],
        ],
        'санкт-петербург': [
            ['69', '15-05-2020', '20:00'], ['70', '25-05-2020', '20:00'], ['71', '15-06-2020', '20:00'],
            ['72', '25-06-2020', '20:00'], ['73', '15-07-2020', '20:00'], ['74', '25-07-2020', '20:00'],

        ],
        'париж': [
            ['87', '11-05-2020', '20:00'], ['88', '18-05-2020', '20:00'], ['89', '25-05-2020', '20:00'],
            ['90', '01-06-2020', '20:00'], ['91', '15-07-2020', '20:00'], ['92', '25-07-2020', '20:00'],

        ],
    },

    'париж': {
        'москва': [
            ['53', '12-05-2020', '18:00'], ['54', '14-05-2020', '18:00'], ['55', '19-05-2020', '18:00'],
            ['56', '21-05-2020', '18:00'], ['57', '26-05-2020', '18:00'], ['58', '28-05-2020', '18:00'],
            ['59', '02-06-2020', '18:00'], ['60', '04-06-2020', '18:00'], ['61', '09-06-2020', '18:00'],
            ['62', '11-06-2020', '18:00']
        ],
        'санкт-петербург': [],
        'нью-йорк': [
            ['93', '11-05-2020', '03:00'], ['94', '18-05-2020', '03:00'], ['95', '25-05-2020', '03:00'],
            ['96', '01-06-2020', '03:00'], ['97', '15-07-2020', '03:00'], ['98', '25-07-2020', '03:00'],
        ],
    },
}

DB_CONFIG = dict(
    provider='postgres',
    user='postgres',
    password='123456',
    host='127.0.0.1',
    database='chatbot'
)
